{
  "name": {
    "chinese": "Zhewei Wang",
    "english": "David"
  },
  "profile": {
    "photo": "David's profile photo",
    "job_application": "Frontend Development",
    "phone": "+86 13636472690",
    "email": "zw3636@nyu.edu",
    "website": "www.davidzheweiwang.com",
    "location": [
      "Shanghai",
      "New York"
    ]
  },
  "education": [
    {
      "school": "NYU Shanghai (QS Ranking 2025: #43)",
      "degree": "Bachelor of Science",
      "major": "Computer Science",
      "minor": "Interactive Media Arts",
      "gpa": "3.6/4.0",
      "period": "Sep 2022 - May 2026",
      "graduation": "May 2026",
      "courses": [
        "Web Design (HTML, CSS, JS)",
        "Data Structures",
        "Algorithm Design",
        "Linear Algebra",
        "Calculus",
        "Machine Learning"
      ]
    }
  ],
  "work_experience": [
    {
      "role": "Frontend Development Intern",
      "organization": "International Business Unit, Beijing Didi Unlimited Technology Development Co., Ltd.",
      "period": "Jun 2025 - Aug 2025",
      "tech_stack": [
        "Vue3",
        "Vue2",
        "TypeScript"
      ],
      "details": [
        "Independently coordinated with product, design, backend, data warehouse, finance, QA, and localization teams to deliver requirements on time and with high quality; participated in requirement analysis and technical solution design.",
        "Demonstrated strong coordination and communication skills by taking on project management and liaison roles at key delivery milestones, ensuring timely and high-quality deliverables.",
        "Engaged in business development and feature iterations within a micro-frontend framework. Contributed to cross-platform application development based on Electron and H5 for both desktop and mobile.",
        "Optimized internationalization (i18n) user experience, improving usability and satisfaction; during tenure, user base increased by 12%."
      ]
    },
    {
      "role": "Student Researcher",
      "organization": "Digital Heritage Lab, NYU Shanghai",
      "period": "May 2024 - Present",
      "tech_stack": [
        "Unity",
        "Three.js",
        "TypeScript",
        "React",
        "Next.js"
      ],
      "details": [
        "Led development of a Unity-based AR application that reconstructed the historical architecture of Zhenru Temple through AR glasses for an immersive cultural experience.",
        "Built a digital museum website using Three.js and React to showcase Zhenru Temple’s history and culture, enhancing public engagement with digital heritage.",
        "Optimized rendering performance and spatial tracking to ensure stable operation across diverse hardware, advancing digital cultural heritage preservation."
      ]
    }
  ],
  "projects": [
    {
      "name": "NYU GO",
      "tech_stack": [
        "React",
        "Next.js",
        "TailwindCSS",
        "TypeScript",
        "Zustand"
      ],
      "period": "Dec 2024 - Present",
      "details": [
        "Initiated development of a real-time campus shuttle tracking app to address inefficiencies in commuting and frequent class delays caused by bus lateness.",
        "Delivered a lightweight, responsive PWA system with features including live location tracking and estimated arrival times.",
        "Independently built the frontend with Next.js and TailwindCSS, integrated WebSocket for real-time shuttle updates, applied SSR for faster initial load, and used Zustand for consistent state management.",
        "App has been deployed for campus-wide use, with 100+ daily visits, significantly reducing waiting time and receiving strong positive feedback."
      ]
    },
    {
      "name": "Sanxingdui Digital Museum",
      "link": "www.sanxingdui.online",
      "tech_stack": [
        "Dean’s Undergraduate Research Fund (DURF), NYU Shanghai"
      ],
      "period": "Apr 2024 - Aug 2024",
      "details": [
        "Served as the main developer for a web-based digital museum showcasing Sanxingdui cultural heritage.",
        "Recreated an interactive 3D exhibition hall on the web to increase public engagement with cultural heritage.",
        "Implemented high-performance real-time 3D rendering using Three.js; built responsive UI with React and MUI; contributed to content planning to ensure historical accuracy.",
        "Project successfully launched, receiving thousands of visits and positive feedback from both faculty and the public; selected as an exemplary student research project by the university."
      ]
    },
    {
      "name": "Interactive Node-Based Music System",
      "link": "https://www.davidzheweiwang.com/posts/lets-jam",
      "tech_stack": [
        "React",
        "Tone.js",
        "React Flow",
        "Zustand",
        "Supabase",
        "Next.js",
        "TailwindCSS",
        "TypeScript"
      ],
      "period": "Sep 2024 - Dec 2024",
      "details": [
        "Built a visual, node-based music synthesis platform enabling users with no music background to create sounds by dragging nodes.",
        "Developed graphical interface with React and React Flow; integrated Tone.js for audio synthesis and playback; used Zustand for efficient state management; implemented user sessions and storage via Supabase.",
        "Project was highly praised by peers and instructors, recognized as the best project of the course, and featured in personal portfolio."
      ]
    },
    {
      "name": "Personal Portfolio Website",
      "link": "www.davidzheweiwang.com",
      "tech_stack": [
        "React",
        "Next.js",
        "TailwindCSS",
        "TypeScript"
      ],
      "period": "Sep 2024 - Present",
      "details": [
        "Independently designed and developed a personal portfolio website with Markdown-to-HTML blog updates.",
        "Implemented component-based architecture and responsive design with React, Next.js, and TailwindCSS, balancing aesthetics and performance.",
        "Optimized for cross-device browsing with enhanced mobile and desktop experiences, boosting performance and maintainability."
      ]
    }
  ],
  "skills": {
    "programming_languages": [
      "C++",
      "C#",
      "C",
      "Pascal",
      "Python",
      "JavaScript"
    ],
    "web_development": "HTML CSS JS | React Next.js Vue2 Vue3 | Zustand Pinia | TailwindCSS MUI Shadcn | React Flow Three.js P5.js | Supabase Express",
    "game_development": [
      "Unity",
      "GameMaker"
    ],
    "soft_skills": [
      "Chinese (Native)",
      "English (Fluent)"
    ]
  },
  "interests": "Professionally trained jazz musician and multi-instrumentalist."
}