{
  "name": {
    "chinese": "Zhewei Wang",
    "english": "David"
  },
  "profile": {
    "photo": "David's profile photo",
    "job_application": "Frontend Intern",
    "phone": "+86 13636472690",
    "email": "zw3636@nyu.edu",
    "website": "www.davidzheweiwang.com",
    "location": ["Shanghai", "New York"]
  },
  "education": [
    {
      "school": "NYU Shanghai",
      "degree": "Bachelor of Science",
      "major": "Computer Science",
      "minor": "Interactive Media Arts",
      "gpa": "3.6/4.0",
      "period": "Sep 2024 - May 2026",
      "graduation": "May 2026",
      "courses": [
        "Machine Learning",
        "P5JS",
        "Unity & C#",
        "Web Design (HTML, CSS, JS)",
        "Data Structures",
        "Algorithms",
        "Linear Algebra",
        "Calculus"
      ]
    }
  ],
  "work_experience": [
    {
      "role": "Student Researcher",
      "organization": "Digital Heritage Lab, NYU Shanghai",
      "period": "May 2024 - Present",
      "details": [
        "Led the development of an AR application using Unity to reconstruct the historical architecture of Zhenru Temple on AR glasses, creating an immersive experience that enhances cultural heritage transmission.",
        "Integrated 3D modeling, material mapping, and lighting techniques to build a highly realistic and interactive educational scene.",
        "Optimized rendering performance and spatial tracking to ensure stable operation on AR hardware, contributing to the dissemination and preservation of digital cultural heritage."
      ]
    },
    {
      "role": "Audit Intern",
      "organization": "Baker Tilly International, Shanghai",
      "period": "May 2024 - Aug 2024",
      "details": [
        "Participated in IT audit projects, assisting in the analysis of client IT system security policies, access control, and compliance metrics.",
        "Used programming skills to help develop automation scripts for data filtering and processing, improving audit efficiency.",
        "Drafted technical documentation and audit findings to support formal reporting and initial drafts."
      ]
    },
    {
      "role": "Orientation Ambassador",
      "organization": "First Year Programs, NYU Shanghai",
      "period": "Apr 2023 - Nov 2023",
      "details": [
        "Served as a student guide during the orientation period, answering common questions and offering life and academic advice to help new students integrate quickly into the university community.",
        "Planned and coordinated multiple orientation events including campus tours, cultural lectures, and social gatherings to boost first-year engagement.",
        "Strengthened communication and organizational skills in a fast-paced, multitasking environment."
      ]
    }
  ],
  "projects": [
    {
      "name": "NYU GO",
      "tech_stack": [
        "React",
        "Next.js",
        "TailwindCSS",
        "TypeScript",
        "Zustand"
      ],
      "period": "Dec 2024 - Present",
      "details": [
        "Developed a real-time school bus tracking app to address commuting delays that caused students to miss classes.",
        "Built a lightweight, responsive PWA with live location tracking and ETA display.",
        "Independently used Next.js and Tailwind CSS for the frontend, integrated WebSocket for real-time updates, SSR for faster loading, and Zustand for consistent state management.",
        "Now actively used on campus with 100+ daily visits, significantly reducing wait times and receiving positive feedback."
      ]
    },
    {
      "name": "Sanxingdui Digital Museum",
      "link": "www.sanxingdui.online",
      "tech_stack": ["Deans' Undergraduate Research Fund (DURF), NYU Shanghai"],
      "period": "Apr 2024 - Aug 2024",
      "details": [
        "Lead developer for a DURF-funded web-based digital museum showcasing the Sanxingdui cultural heritage.",
        "Created an interactive 3D virtual exhibition to engage the public with digital cultural artifacts.",
        "Implemented real-time 3D rendering with Three.js and built a responsive UI using React and MUI, ensuring a smooth experience across devices; also contributed to content planning for historical accuracy.",
        "The site attracted thousands of visitors, received praise from faculty and the public, and was featured as an exemplary student research project."
      ]
    },
    {
      "name": "Interactive Node-Based Music System",
      "link": "https://www.davidzheweiwang.com/posts/lets-jam",
      "tech_stack": [
        "React",
        "Tone.js",
        "React Flow",
        "Zustand",
        "Supabase",
        "Next.js",
        "TailwindCss",
        "TypeScript"
      ],
      "period": "Sep 2024 - Dec 2024",
      "details": [
        "Designed an interactive online system to explore the intersection of music and programming, encouraging creative expression.",
        "Built a visual node-based music platform enabling users to create sounds in real time without any musical background.",
        "Developed the UI with React and React Flow for modular audio blocks; integrated Tone.js for synthesis and playback, Zustand for responsive state management, and Supabase for user sessions and data storage.",
        "Well received by peers and instructors, the project was selected as one of the best course demos and featured in my personal portfolio."
      ]
    },
    {
      "name": "Personal Portfolio Website",
      "link": "www.davidzheweiwang.com",
      "tech_stack": ["React", "Next.js", "TailwindCSS", "TypeScript"],
      "period": "Sep 2024 - Present",
      "details": [
        "Independently designed and developed a personal portfolio website to showcase projects and skills.",
        "Built with React, Next.js, and Tailwind CSS for component-based development and responsive design.",
        "Optimized for both mobile and desktop devices, ensuring fast load times and easy maintenance."
      ]
    }
  ],
  "skills": {
    "programming_languages": [
      "C++",
      "C#",
      "C",
      "Pascal",
      "Python",
      "JavaScript"
    ],
    "web_development": "HTML CSS JS | React Next.js Vue2 Vue3 | Zustand Pinia | TailwindCSS MUI Shadcn | reactflow Three.js P5JS | Supabase Express | ",
    "game_development": ["Unity", "GameMaker"],
    "soft_skills": ["Chinese (Native)", "English (Fluent)"]
  },
  "interests": "Professionally trained jazz musician and multi-instrumentalist."
}
